<a href="https://colab.research.google.com/github/bitgn/ml-course/blob/master/MLP_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Chapter 2. Data Science is done in Python


Python is currently the most popular day-to-day language that Data
Scientists use to develop their models (e.g. Jupyter Notebooks,
pandas, numpy, matplotlib). A lot of data processing is done in this
language as well (Apache Airflow, Dask Distributed, Apache Beam).

Notebooks are an interactive way to work with Python environments. For the purpose of this course we will start with Google Collab notebooks.

## Getting Started

The document you are reading is a  [Jupyter notebook](https://jupyter.org/), hosted in Colaboratory. It is not a static page, but an interactive environment that lets you write and execute code in Python and other languages.

For example, here is a **code cell** with a short Python script that computes a value, stores it in a variable, and prints the result:

In [5]:
bytes_in_MiB= 2 ** 20
bytes_in_MiB

1048576

To execute the code in the above cell, select it with a click and then either press the play button to the left of the code, or use the keyboard shortcut "Command/Ctrl+Enter".

All cells modify the same global state, so variables that you define by executing a cell can be used in other cells:

In [6]:
bytes_in_GiB = bytes_in_MiB * 1024
bytes_in_GiB

1073741824

## Data Science in Jupyter

Data scientists use Jupyter notebooks for data exploration, visualization and analysis.

Let's try doing a quick analytis.

First, we import necessary modules under short and convenient names. We'll be mostly using pandas and matplotlib.

In [0]:
import pandas as pd
import matplotlib as mpl

# Quick Intro to Pandas

Pandas is a python library for efficient data manipulation.


The primary data structures in pandas are implemented as two classes:
- DataFrame, which you can imagine as a relational data table, with rows and named columns.
- Series, which is a single column. A DataFrame contains one or more Series and a name for each Series.

The data frame is a commonly used abstraction for data manipulation.

Let's load a TSV file into dataframe.

In [0]:

from io import StringIO

TSV = """
Id	Date	Quantity	Currency	NetAmount
10206	2017-08-15	2	USD	34.7999992
10206	2017-08-22	36	USD	626.400024
10206	2017-08-25	24	USD	417.600006
10206	2017-08-25	24	USD	417.600006
10206	2017-08-28	2	USD	34.7999992
10206	2017-08-31	2	USD	34.7999992
10206	2017-08-31	4	USD	69.5999985
10206	2017-08-31	4	USD	69.5999985
10206	2017-08-31	2	USD	34.7999992
10206	2017-08-31	4	USD	69.5999985
10206	2017-08-31	2	USD	34.7999992
10206	2017-08-31	4	USD	69.5999985
10206	2017-08-31	4	USD	69.5999985
10206	2017-08-31	6	USD	104.400002
10206	2017-08-31	4	USD	69.5999985
10206	2017-08-31	4	USD	69.5999985
10206	2017-08-31	4	USD	69.5999985
10206	2017-09-05	2	USD	34.7999992
10206	2017-09-11	4	USD	69.5999985
10206	2017-09-11	2	USD	34.7999992
10206	2017-09-13	4	USD	69.5999985
10206	2017-09-18	6	USD	104.400002
10206	2017-09-18	2	USD	34.7999992
10206	2017-09-20	6	USD	104.400002
10206	2017-09-22	2	USD	34.7999992"""


df = pd.read_csv(StringIO(TSV), sep='\t')

Once we have a data frame, we could investigate it. Let's look at the beginning.

In [15]:
df.head()

      Id        Date  Quantity Currency   NetAmount
0  10206  2017-08-15         2      USD   34.799999
1  10206  2017-08-22        36      USD  626.400024
2  10206  2017-08-25        24      USD  417.600006
3  10206  2017-08-25        24      USD  417.600006
4  10206  2017-08-28         2      USD   34.799999

In [19]:
sales_by_date = df.groupby(['Date']).sum()
sales_by_date

                Id  Quantity   NetAmount
Date
2017-08-15   10206         2   34.799999
2017-08-22   10206        36  626.400024
2017-08-25   20412        48  835.200012
2017-08-28   10206         2   34.799999
2017-08-31  122472        44  765.599988
2017-09-05   10206         2   34.799999
2017-09-11   20412         6  104.399998
2017-09-13   10206         4   69.599998
2017-09-18   20412         8  139.200001
2017-09-20   10206         6  104.400002
2017-09-22   10206         2   34.799999